adailtonjn68/STM32-Assembly-Blink-LED-With-SysTick/Core/Inc/stm32f10x_gpio.inc
.syntax unified
.cpu cortex-m3
.fpu softvfp
.thumb

.include "stm32f10x_constants.inc"


@ GPIO constants
.equ GPIO_CRL_CNF7,         (BIT31 | BIT30)
.equ GPIO_CRL_CNF6,         (BIT27 | BIT26)
.equ GPIO_CRL_CNF5,         (BIT23 | BIT22)
.equ GPIO_CRL_CNF4,         (BIT19 | BIT18)
.equ GPIO_CRL_CNF3,         (BIT15 | BIT14)
.equ GPIO_CRL_CNF2,         (BIT11 | BIT10)
.equ GPIO_CRL_CNF1,         (BIT7 | BIT6)
.equ GPIO_CRL_CNF0,         (BIT3 | BIT2)

.equ GPIO_CRL_MODE7,        (BIT29 | BIT28)
.equ GPIO_CRL_MODE6,        (BIT25 | BIT24)
.equ GPIO_CRL_MODE5,        (BIT21 | BIT20)
.equ GPIO_CRL_MODE4,        (BIT17 | BIT16)
.equ GPIO_CRL_MODE3,        (BIT13 | BIT12)
.equ GPIO_CRL_MODE2,        (BIT9 | BIT8)
.equ GPIO_CRL_MODE1,        (BIT5 | BIT4)
.equ GPIO_CRL_MODE0,        (BIT1 | BIT0)

.equ GPIO_CRL_CNF7_0,       (BIT30)
.equ GPIO_CRL_CNF7_1,       (BIT31)
.equ GPIO_CRL_CNF6_0,       (BIT26)
.equ GPIO_CRL_CNF6_1,       (BIT27)
.equ GPIO_CRL_CNF5_0,       (BIT22)
.equ GPIO_CRL_CNF5_1,       (BIT23)
.equ GPIO_CRL_CNF4_0,       (BIT18)
.equ GPIO_CRL_CNF4_1,       (BIT19)
.equ GPIO_CRL_CNF3_0,       (BIT14)
.equ GPIO_CRL_CNF3_1,       (BIT15)
.equ GPIO_CRL_CNF2_0,       (BIT10)
.equ GPIO_CRL_CNF2_1,       (BIT11)
.equ GPIO_CRL_CNF1_0,       (BIT6)
.equ GPIO_CRL_CNF1_1,       (BIT7)
.equ GPIO_CRL_CNF0_0,       (BIT2)
.equ GPIO_CRL_CNF0_1,       (BIT3)

.equ GPIO_CRL_MODE7_0,      (BIT28)
.equ GPIO_CRL_MODE7_1,      (BIT29)
.equ GPIO_CRL_MODE6_0,      (BIT24)
.equ GPIO_CRL_MODE6_1,      (BIT25)
.equ GPIO_CRL_MODE5_0,      (BIT20)
.equ GPIO_CRL_MODE5_1,      (BIT21)
.equ GPIO_CRL_MODE4_0,      (BIT16)
.equ GPIO_CRL_MODE4_1,      (BIT17)
.equ GPIO_CRL_MODE3_0,      (BIT12)
.equ GPIO_CRL_MODE3_1,      (BIT13)
.equ GPIO_CRL_MODE2_0,      (BIT8)
.equ GPIO_CRL_MODE2_1,      (BIT9)
.equ GPIO_CRL_MODE1_0,      (BIT4)
.equ GPIO_CRL_MODE1_1,      (BIT5)
.equ GPIO_CRL_MODE0_0,      (BIT0)
.equ GPIO_CRL_MODE0_1,      (BIT1)

.equ GPIO_CRH_CNF15,        (BIT31 | BIT30)
.equ GPIO_CRH_CNF14,        (BIT27 | BIT26)
.equ GPIO_CRH_CNF13,        (BIT23 | BIT22)
.equ GPIO_CRH_CNF12,        (BIT19 | BIT18)
.equ GPIO_CRH_CNF11,        (BIT15 | BIT14)
.equ GPIO_CRH_CNF10,        (BIT11 | BIT10)
.equ GPIO_CRH_CNF9,         (BIT7 | BIT6)
.equ GPIO_CRH_CNF8,         (BIT3 | BIT2)

.equ GPIO_CRH_MODE15,       (BIT29 | BIT28)
.equ GPIO_CRH_MODE14,       (BIT25 | BIT24)
.equ GPIO_CRH_MODE13,       (BIT21 | BIT20)
.equ GPIO_CRH_MODE12,       (BIT17 | BIT16)
.equ GPIO_CRH_MODE11,       (BIT13 | BIT12)
.equ GPIO_CRH_MODE10,       (BIT9 | BIT8)
.equ GPIO_CRH_MODE9,        (BIT5 | BIT4)
.equ GPIO_CRH_MODE8,        (BIT1 | BIT0)

.equ GPIO_CRH_CNF15_0,      (BIT30)
.equ GPIO_CRH_CNF15_1,      (BIT31)
.equ GPIO_CRH_CNF14_0,      (BIT26)
.equ GPIO_CRH_CNF14_1,      (BIT27)
.equ GPIO_CRH_CNF13_0,      (BIT22)
.equ GPIO_CRH_CNF13_1,      (BIT23)
.equ GPIO_CRH_CNF12_0,      (BIT18)
.equ GPIO_CRH_CNF12_1,      (BIT19)
.equ GPIO_CRH_CNF11_0,      (BIT14)
.equ GPIO_CRH_CNF11_1,      (BIT15)
.equ GPIO_CRH_CNF10_0,      (BIT10)
.equ GPIO_CRH_CNF10_1,      (BIT11)
.equ GPIO_CRH_CNF9_0,       (BIT6)
.equ GPIO_CRH_CNF9_1,       (BIT7)
.equ GPIO_CRH_CNF8_0,       (BIT2)
.equ GPIO_CRH_CNF8_1,       (BIT3)

.equ GPIO_CRH_MODE15_0,     (BIT28)
.equ GPIO_CRH_MODE15_1,     (BIT29)
.equ GPIO_CRH_MODE14_0,     (BIT24)
.equ GPIO_CRH_MODE14_1,     (BIT25)
.equ GPIO_CRH_MODE13_0,     (BIT20)
.equ GPIO_CRH_MODE13_1,     (BIT21)
.equ GPIO_CRH_MODE12_0,     (BIT16)
.equ GPIO_CRH_MODE12_1,     (BIT17)
.equ GPIO_CRH_MODE11_0,     (BIT12)
.equ GPIO_CRH_MODE11_1,     (BIT13)
.equ GPIO_CRH_MODE10_0,     (BIT8)
.equ GPIO_CRH_MODE10_1,     (BIT9)
.equ GPIO_CRH_MODE9_0,      (BIT4)
.equ GPIO_CRH_MODE9_1,      (BIT5)
.equ GPIO_CRH_MODE8_0,      (BIT0)
.equ GPIO_CRH_MODE8_1,      (BIT1)

.equ GPIO_BSRR_BR15,        (BIT15 << 16)
.equ GPIO_BSRR_BR14,        (BIT14 << 16)
.equ GPIO_BSRR_BR13,        (BIT13 << 16)
.equ GPIO_BSRR_BR12,        (BIT12 << 16)
.equ GPIO_BSRR_BR11,        (BIT11 << 16)
.equ GPIO_BSRR_BR10,        (BIT10 << 16)
.equ GPIO_BSRR_BR9,         (BIT9 << 16)
.equ GPIO_BSRR_BR8,         (BIT8 << 16)
.equ GPIO_BSRR_BR7,         (BIT7 << 16)
.equ GPIO_BSRR_BR6,         (BIT6 << 16)
.equ GPIO_BSRR_BR5,         (BIT5 << 16)
.equ GPIO_BSRR_BR4,         (BIT4 << 16)
.equ GPIO_BSRR_BR3,         (BIT3 << 16)
.equ GPIO_BSRR_BR2,         (BIT2 << 16)
.equ GPIO_BSRR_BR1,         (BIT1 << 16)
.equ GPIO_BSRR_BR0,         (BIT0 << 16)

.equ GPIO_BSRR_BS15,        (BIT15)
.equ GPIO_BSRR_BS14,        (BIT14)
.equ GPIO_BSRR_BS13,        (BIT13)
.equ GPIO_BSRR_BS12,        (BIT12)
.equ GPIO_BSRR_BS11,        (BIT11)
.equ GPIO_BSRR_BS10,        (BIT10)
.equ GPIO_BSRR_BS9,         (BIT9)
.equ GPIO_BSRR_BS8,         (BIT8)
.equ GPIO_BSRR_BS7,         (BIT7)
.equ GPIO_BSRR_BS6,         (BIT6)
.equ GPIO_BSRR_BS5,         (BIT5)
.equ GPIO_BSRR_BS4,         (BIT4)
.equ GPIO_BSRR_BS3,         (BIT3)
.equ GPIO_BSRR_BS2,         (BIT2)
.equ GPIO_BSRR_BS1,         (BIT1)
.equ GPIO_BSRR_BS0,         (BIT0)

.equ GPIO_Pin_0,            (BIT0)
.equ GPIO_Pin_1,            (BIT1)
.equ GPIO_Pin_2,            (BIT2)
.equ GPIO_Pin_3,            (BIT3)
.equ GPIO_Pin_4,            (BIT4)
.equ GPIO_Pin_5,            (BIT5)
.equ GPIO_Pin_6,            (BIT6)
.equ GPIO_Pin_7,            (BIT7)
.equ GPIO_Pin_8,            (BIT8)
.equ GPIO_Pin_9,            (BIT9)
.equ GPIO_Pin_10,           (BIT10)
.equ GPIO_Pin_11,           (BIT11)
.equ GPIO_Pin_12,           (BIT12)
.equ GPIO_Pin_13,           (BIT13)
.equ GPIO_Pin_14,           (BIT14)
.equ GPIO_Pin_15,           (BIT15)

